Repository: AbdoMan19/SnapNFix-Backend
Catalog: SnapNFix.Application/Resources/Shared.*.resx
Languages: ar

# OperationSuccessful
source: The operation was completed successfully
ar: تمت العملية بنجاح

# LoginSuccess
source: Login successful
ar: تم تسجيل الدخول بنجاح

# RegistrationSuccess
source: Registration completed successfully
ar: تم التسجيل بنجاح

# LogoutSuccess
source: Logout successful
ar: تم تسجيل الخروج بنجاح

# OtpSent
source: OTP sent successfully
ar: تم إرسال رمز التحقق بنجاح

# PhoneVerified
source: Phone number verified successfully
ar: تم التحقق من رقم الهاتف بنجاح

# PasswordReset
source: Password reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح

# ProfileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# ReportCreated
source: Report created successfully
ar: تم إنشاء البلاغ بنجاح

# ReportUpdated
source: Report updated successfully
ar: تم تحديث البلاغ بنجاح

source: Operation failed
ar: فشلت العملية

# UnexpectedError
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# ValidationError
source: Validation failed
ar: فشل في التحقق من صحة البيانات

# InvalidCredentials
source: Invalid email/phone or password
ar: البريد الإلكتروني/الهاتف أو كلمة المرور غير صحيحة

source: User not found
ar: المستخدم غير موجود

# EmailOrPhoneNotFound
source: Email or phone number not found
ar: البريد الإلكتروني أو رقم الهاتف غير موجود

# AccountSuspended
source: Account is suspended
ar: الحساب معلق

# AccountLocked
source: Account is temporarily locked
ar: الحساب مقفل مؤقتاً

# EmailNotConfirmed
source: Email address not confirmed
ar: البريد الإلكتروني غير مؤكد

# PhoneNotConfirmed
source: Phone number not confirmed
ar: رقم الهاتف غير مؤكد

# InvalidRefreshToken
source: Invalid or expired refresh token
ar: رمز التحديث غير صالح أو منتهي الصلاحية

# RefreshTokenRequired
source: Refresh token is required
ar: رمز التحديث مطلوب

source: Invalid Google token
ar: رمز جوجل غير صالح

source: Access denied
ar: تم رفض الوصول

source: Admin role required
ar: صلاحية المدير مطلوبة

# InvalidPassword
source: The password is invalid
ar: كلمة المرور غير صحيحة

# UserLockedOut
source: The user account is locked out
ar: حساب المستخدم مقفل

source: Registration failed
ar: فشل التسجيل

# EmailAlreadyRegistered
source: Email is already registered
ar: البريد الإلكتروني مسجل بالفعل

# PhoneAlreadyRegistered
source: Phone number is already registered
ar: رقم الهاتف مسجل بالفعل

source: Invalid verification code
ar: رمز التحقق غير صحيح

# LogoutFailed
source: Failed to logout
ar: فشل تسجيل الخروج

# FieldRequired
source: {0} is required
ar: {0} مطلوب

# EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# PhoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# PhoneNumberRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# EmailOrPhoneNumberRequired
source: Email or phone number is required
ar: البريد الإلكتروني أو رقم الهاتف مطلوب

# InvalidEmailOrPhoneNumber
source: Please enter a valid email address or Egyptian phone number
ar: يرجى إدخال بريد إلكتروني صحيح أو رقم هاتف مصري صحيح

# PasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# FirstNameRequired
source: First name is required
ar: الاسم الأول مطلوب

# LastNameRequired
source: Last name is required
ar: الاسم الأخير مطلوب

# ConfirmPasswordRequired
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

# OtpRequired
source: OTP is required
ar: رمز التحقق مطلوب

# InvalidEmail
source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صحيح

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صحيح

# InvalidPhoneNumber
source: Invalid Egyptian phone number format
ar: تنسيق رقم الهاتف المصري غير صحيح

# InvalidOtp
source: Invalid OTP code
ar: رمز التحقق غير صحيح

source: Invalid OTP length
ar: رمز التحقق يجب أن يكون 6 أرقام

# PasswordTooShort
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل

# PasswordMissingUpper
source: Password must contain at least one uppercase letter
ar: كلمة المرور يجب أن تحتوي على حرف كبير واحد على الأقل

# PasswordMissingLower
source: Password must contain at least one lowercase letter
ar: كلمة المرور يجب أن تحتوي على حرف صغير واحد على الأقل

# PasswordMissingNumber
source: Password must contain at least one number
ar: كلمة المرور يجب أن تحتوي على رقم واحد على الأقل

# PasswordMissingSpecial
source: Password must contain at least one special character
ar: كلمة المرور يجب أن تحتوي على رمز خاص واحد على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# EmailAlreadyExists
source: Email address already exists
ar: البريد الإلكتروني موجود بالفعل

# PhoneAlreadyExists
source: Phone number already exists
ar: رقم الهاتف موجود بالفعل

# FirstNameLength
source: First name must be between 2 and 50 characters
ar: الاسم الأول يجب أن يكون بين 2 و 50 حرف

# FirstNameInvalid
source: First name can only contain letters (Arabic and English)
ar: الاسم الأول يمكن أن يحتوي على حروف فقط (عربية وإنجليزية)

# LastNameLength
source: Last name must be between 2 and 50 characters
ar: الاسم الأخير يجب أن يكون بين 2 و 50 حرف

# LastNameInvalid
source: Last name can only contain letters (Arabic and English)
ar: الاسم الأخير يمكن أن يحتوي على حروف فقط (عربية وإنجليزية)

# LocationOutsideEgypt
source: Reports can only be created within Egypt's borders
ar: يمكن إنشاء البلاغات داخل حدود مصر فقط

# LocationTooFarSouth
source: Location is too far south. Reports can only be created within Egypt's borders
ar: الموقع بعيد جداً جنوباً. يمكن إنشاء البلاغات داخل حدود مصر فقط

# LocationTooFarNorth
source: Location is too far north. Reports can only be created within Egypt's borders
ar: الموقع بعيد جداً شمالاً. يمكن إنشاء البلاغات داخل حدود مصر فقط

# LocationTooFarWest
source: Location is too far west. Reports can only be created within Egypt's borders
ar: الموقع بعيد جداً غرباً. يمكن إنشاء البلاغات داخل حدود مصر فقط

# LocationTooFarEast
source: Location is too far east. Reports can only be created within Egypt's borders
ar: الموقع بعيد جداً شرقاً. يمكن إنشاء البلاغات داخل حدود مصر فقط

# ImageRequired
source: Image is required
ar: الصورة مطلوبة

# InvalidImageFormat
source: Invalid image format. Only JPG, JPEG, PNG are allowed
ar: تنسيق الصورة غير صحيح. فقط JPG، JPEG، PNG مسموحة

# ImageTooLarge
source: Image size should not exceed {0}MB
ar: حجم الصورة يجب ألا يتجاوز {0} ميجابايت

# InvalidImageFile
source: The file is not a valid image
ar: الملف ليس صورة صالحة

source: Report not found
ar: البلاغ غير موجود

source: Issue not found
ar: المشكلة غير موجودة

# DeviceIdRequired
source: Device ID is required
ar: معرف الجهاز مطلوب

# DeviceNameRequired
source: Device name is required
ar: اسم الجهاز مطلوب

# DeviceTypeRequired
source: Device type is required
ar: نوع الجهاز مطلوب

# PlatformRequired
source: Platform is required
ar: المنصة مطلوبة

# ContactNotFound
source: Contact number not found
ar: رقم الاتصال غير موجود

# TokenGenerationFailed
source: Failed to generate token
ar: فشل في إنشاء الرمز المميز

# FCMTokenRequired
source: FCM Token is required
ar: رمز FCM مطلوب

# TaskIdRequired
source: Task ID is required
ar: معرف المهمة مطلوب

source: Invalid image status
ar: حالة الصورة غير صحيحة

source: Invalid report category
ar: فئة البلاغ غير صحيحة

# InvalidThreshold
source: Threshold must be between 0 and 1
ar: العتبة يجب أن تكون بين 0 و 1

# CommentMaxLength
source: Comment cannot exceed 500 characters
ar: التعليق لا يمكن أن يتجاوز 500 حرف

# CommentRequired
source: Comment is required
ar: التعليق مطلوب

# RoadRequired
source: Road is required
ar: الطريق مطلوب

# RoadMaxLength
source: Road cannot exceed 200 characters
ar: الطريق لا يمكن أن يتجاوز 200 حرف

# CityMaxLength
source: City cannot exceed 100 characters
ar: المدينة لا يمكن أن تتجاوز 100 حرف

# StateMaxLength
source: State cannot exceed 100 characters
ar: المحافظة لا يمكن أن تتجاوز 100 حرف

# CountryMaxLength
source: Country cannot exceed 100 characters
ar: البلد لا يمكن أن يتجاوز 100 حرف

# LatitudeRequired
source: Latitude is required
ar: خط العرض مطلوب

# LongitudeRequired
source: Longitude is required
ar: خط الطول مطلوب

# LatitudeRange
source: Latitude must be between -90 and 90 degrees
ar: خط العرض يجب أن يكون بين -90 و 90 درجة

# LongitudeRange
source: Longitude must be between -180 and 180 degrees
ar: خط الطول يجب أن يكون بين -180 و 180 درجة

# InvalidSeverity
source: Invalid severity level
ar: مستوى الخطورة غير صحيح

# IssueIdRequired
source: Issue ID is required
ar: معرف المشكلة مطلوب

# InvalidGuid
source: Issue ID must be a valid GUID
ar: معرف المشكلة يجب أن يكون معرف صحيح

# PageNumberRequired
source: Page number is required
ar: رقم الصفحة مطلوب

# InvalidPageNumber
source: Page number must be greater than zero
ar: رقم الصفحة يجب أن يكون أكبر من صفر

# PageSizeRequired
source: Page size is required
ar: حجم الصفحة مطلوب

# InvalidPageSize
source: Page size must be between 1 and 50
ar: حجم الصفحة يجب أن يكون بين 1 و 100

# LimitRequired
source: Limit is required
ar: الحد الأقصى مطلوب

# InvalidLimit
source: Limit must be between 1 and 100
ar: الحد الأقصى يجب أن يكون بين 1 و 100

# MaxResultsRequired
source: Max results is required
ar: الحد الأقصى للنتائج مطلوب

# InvalidMaxResults
source: Max results must be between 1 and 500
ar: الحد الأقصى للنتائج يجب أن يكون بين 1 و 500

# MaxResultsExceeded
source: Max results must not exceed 500 for performance reasons.
ar: الحد الأقصى للنتائج لا يمكن أن يتجاوز 500

# NorthEastLatRequired
source: North East Latitude is required
ar: خط عرض الشمال الشرقي مطلوب

# NorthEastLngRequired
source: North East Longitude is required
ar: خط طول الشمال الشرقي مطلوب

# SouthWestLatRequired
source: South West Latitude is required
ar: خط عرض الجنوب الغربي مطلوب

# SouthWestLngRequired
source: South West Longitude is required
ar: خط طول الجنوب الغربي مطلوب

# InvalidLatitudeRange
source: Latitude must be between -90 and 90 degrees
ar: خط العرض يجب أن يكون بين -90 و 90 درجة

# InvalidLongitudeRange
source: Longitude must be between -180 and 180 degrees
ar: خط الطول يجب أن يكون بين -180 و 180 درجة

# InvalidViewportBounds
source: Invalid viewport bounds: NorthEast coordinates must be greater than SouthWest coordinates
ar: حدود العرض غير صحيحة: إحداثيات الشمال الشرقي يجب أن تكون أكبر من إحداثيات الجنوب الغربي

# ViewportTooLarge
source: Viewport cannot exceed 10 degrees in width or height
ar: نافذة العرض لا يمكن أن تتجاوز 10 درجات في العرض أو الارتفاع

# InvalidStatisticsInterval
source: Invalid statistics interval. Must be Monthly, Quarterly, or Yearly
ar: فترة الإحصائيات غير صحيحة. يجب أن تكون شهرية أو ربع سنوية أو سنوية

# TokenRequired
source: Token is required
ar: الرمز المميز مطلوب

# AccessTokenRequired
source: Access token is required
ar: رمز الوصول مطلوب

# StatusPending
source: Pending
ar: قيد الانتظار

# StatusApproved
source: Approved
ar: موافق عليه

# StatusDeclined
source: Declined
ar: مرفوض

# StatusInProgress
source: In Progress
ar: قيد التنفيذ

# StatusCompleted
source: Completed
ar: مكتمل

# CategoryNotSpecified
source: Not Specified
ar: غير محدد

# CategoryPothole
source: Pothole
ar: حفرة في الطريق

# CategoryGarbage
source: Garbage
ar: قمامة

# CategoryDefectiveManhole
source: Defective Manhole
ar: غطاء بالوعة معطل

# CategoryNonDefectiveManhole
source: Non-Defective Manhole
ar: غطاء بالوعة سليم

# SeverityLow
source: Low
ar: منخفض

# SeverityMedium
source: Medium
ar: متوسط

# SeverityHigh
source: High
ar: عالي

# SeverityNotSpecified
source: Not Specified
ar: غير محدد

# GenderMale
source: Male
ar: ذكر

# GenderFemale
source: Female
ar: أنثى

# GenderNotSpecified
source: Not Specified
ar: غير محدد

# InvalidGender
source: Invalid gender value
ar: الجنس غير صحيح

# StatisticsRetrievalError
source: An error occurred while retrieving statistics
ar: حدث خطأ أثناء استرداد الإحصائيات

source: No data available
ar: لا توجد بيانات متاحة

# TargetStatusAhead
source: Ahead
ar: متقدم

# TargetStatusOnTrack
source: On Track
ar: في المسار الصحيح

# TargetStatusBehind
source: Behind
ar: متأخر

source: Create
ar: إنشاء

source: Update
ar: تحديث

source: Delete
ar: حذف

source: Search
ar: بحث

source: Filter
ar: تصفية

source: Sort
ar: ترتيب

source: Submit
ar: إرسال

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Save
ar: حفظ

# InvalidAgeError
source: Age must be between 0 and 120
ar: العمر يجب أن يكون بين 0 و 120

# FutureDateError
source: Birth date cannot be in the future
ar: تاريخ الميلاد لا يمكن أن يكون في المستقبل

# NorthEastLatGreaterThanSouthWestLat
source: North East Latitude must be greater than South West Latitude
ar: يجب أن تكون دائرة العرض الشمالية الشرقية أكبر من دائرة العرض الجنوبية الغربية

# NorthEastLngGreaterThanSouthWestLng
source: North East Longitude must be greater than South West Longitude
ar: يجب أن تكون دائرة الطول الشمالية الشرقية أكبر من دائرة الطول الجنوبية الغربية

# ViewportHeightExceeded
source: Viewport height cannot exceed 10 degrees latitude.
ar: لا يمكن أن يتجاوز ارتفاع منطقة العرض 10 درجات من دائرة العرض.

# ViewportWidthExceeded
source: Viewport width cannot exceed 10 degrees longitude.
ar: لا يمكن أن يتجاوز عرض منطقة العرض 10 درجات من دائرة الطول.

# FailedToGenerateResetToken
source: Failed to generate password reset token
ar: فشل في إنشاء رمز إعادة التعيين

source: Failed to reset password
ar: فشل في إعادة تعيين كلمة المرور

source: Failed to create fast report
ar: فشل في إنشاء التقرير السريع

# InvalidCoordinates
source: Invalid coordinates provided
ar: الإحداثيات غير صحيحة
